---
kind: other
id: Methods.T:Autodesk.Revit.DB.GlobalParametersManager
source: html/db24c5c2-df48-56af-8628-03bca54ad33b.htm
---
# GlobalParametersManager Methods

Tests whether global parameters are allowed in the given document.